
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/a-itabashi/aws-ecs-terraform/actions/runs/14119655873)



<pre><code>Apply complete! Resources: 4 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
[command]/home/runner/work/_temp/ce926fbb-6665-41f3-90f4-4efabf6e1f66/terraform-bin apply -auto-approve -input=false
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-01d2f3607d1897c0b]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-07a0d641cf5155989]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d9f484e26ad70778]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-005b54589c2b6da5f]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0e65c15767a8f3803]
aws_security_group.alb: Refreshing state... [id=sg-012c8de90de2f8baf]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-09569d2eb812a2f7d]
aws_security_group.ecs: Refreshing state... [id=sg-041f8ed7691d70ce5]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-08a9a127f143f34c0]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-04a005e3c981f9801]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0459a6c028894452a]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-030a489d8399a107a]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-06c8865a563239fd1]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0ecb407aff77341b6]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-018ff3bbcd43e1f97]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0f4ab1a1c01510657]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-04a005e3c981f98011080289494]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-844562651]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0c2656be80ccf73b5]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0ab9ee2a722845733]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0e182b46e28a84380]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-094ec60ad1531eeb5]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-00d6b7549b076f2d9]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-04ba37f781522f10e]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-030a489d8399a107a1080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0459a6c028894452a1080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lb.alb will be created
  + resource "aws_lb" "alb" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = (known after apply)
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "go-simple-server-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = [
          + "sg-012c8de90de2f8baf",
        ]
      + subnets                                                      = [
          + "subnet-06c8865a563239fd1",
          + "subnet-0ecb407aff77341b6",
        ]
      + tags_all                                                     = (known after apply)
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_lb_listener.alb_listener will be created
  + resource "aws_lb_listener" "alb_listener" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags_all                                                              = (known after apply)
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Fixed response content"
              + status_code  = "200"
            }
        }

      + mutual_authentication {
          + advertise_trust_store_ca_names   = (known after apply)
          + ignore_client_certificate_expiry = (known after apply)
          + mode                             = (known after apply)
          + trust_store_arn                  = (known after apply)
        }
    }

  # aws_lb_listener_rule.alb_listener_rule will be created
  + resource "aws_lb_listener_rule" "alb_listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = (known after apply)
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {

          + path_pattern {
              + values = [
                  + "*",
                ]
            }
        }
    }

  # aws_lb_target_group.target_group will be created
  + resource "aws_lb_target_group" "target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "go-simple-server-target-group"
      + name_prefix                        = (known after apply)
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-01d2f3607d1897c0b"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/health_checks"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }

      + target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }

      + target_group_health {
          + dns_failover {
              + minimum_healthy_targets_count      = (known after apply)
              + minimum_healthy_targets_percentage = (known after apply)
            }

          + unhealthy_state_routing {
              + minimum_healthy_targets_count      = (known after apply)
              + minimum_healthy_targets_percentage = (known after apply)
            }
        }

      + target_health_state {
          + enable_unhealthy_connection_termination = (known after apply)
          + unhealthy_draining_interval             = (known after apply)
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
aws_lb_target_group.target_group: Creating...
aws_lb.alb: Creating...
aws_lb_target_group.target_group: Creation complete after 2s [id=arn:aws:elasticloadbalancing:ap-northeast-1:683134287515:targetgroup/go-simple-server-target-group/061c4d8d8e9b52ed]
aws_lb.alb: Still creating... [10s elapsed]
aws_lb.alb: Still creating... [20s elapsed]
aws_lb.alb: Still creating... [30s elapsed]
aws_lb.alb: Still creating... [40s elapsed]
aws_lb.alb: Still creating... [50s elapsed]
aws_lb.alb: Still creating... [1m0s elapsed]
aws_lb.alb: Still creating... [1m10s elapsed]
aws_lb.alb: Still creating... [1m20s elapsed]
aws_lb.alb: Still creating... [1m30s elapsed]
aws_lb.alb: Still creating... [1m40s elapsed]
aws_lb.alb: Still creating... [1m50s elapsed]
aws_lb.alb: Still creating... [2m0s elapsed]
aws_lb.alb: Still creating... [2m10s elapsed]
aws_lb.alb: Still creating... [2m20s elapsed]
aws_lb.alb: Still creating... [2m30s elapsed]
aws_lb.alb: Still creating... [2m40s elapsed]
aws_lb.alb: Still creating... [2m50s elapsed]
aws_lb.alb: Still creating... [3m0s elapsed]
aws_lb.alb: Creation complete after 3m5s [id=arn:aws:elasticloadbalancing:ap-northeast-1:683134287515:loadbalancer/app/go-simple-server-alb/ae567f9e14a6567d]
aws_lb_listener.alb_listener: Creating...
aws_lb_listener.alb_listener: Creation complete after 1s [id=arn:aws:elasticloadbalancing:ap-northeast-1:683134287515:listener/app/go-simple-server-alb/ae567f9e14a6567d/e9917478e49912ee]
aws_lb_listener_rule.alb_listener_rule: Creating...
aws_lb_listener_rule.alb_listener_rule: Creation complete after 0s [id=arn:aws:elasticloadbalancing:ap-northeast-1:683134287515:listener-rule/app/go-simple-server-alb/ae567f9e14a6567d/e9917478e49912ee/1c3d616d3793774e]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.
::debug::Terraform exited with code 0.
::debug::stdout: module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-01d2f3607d1897c0b]%0Amodule.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-07a0d641cf5155989]%0Amodule.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d9f484e26ad70778]%0Amodule.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-005b54589c2b6da5f]%0Amodule.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0e65c15767a8f3803]%0Aaws_security_group.alb: Refreshing state... [id=sg-012c8de90de2f8baf]%0Amodule.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-09569d2eb812a2f7d]%0Aaws_security_group.ecs: Refreshing state... [id=sg-041f8ed7691d70ce5]%0Amodule.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-08a9a127f143f34c0]%0Amodule.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-04a005e3c981f9801]%0Amodule.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0459a6c028894452a]%0Amodule.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-030a489d8399a107a]%0Amodule.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-06c8865a563239fd1]%0Amodule.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0ecb407aff77341b6]%0Amodule.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-018ff3bbcd43e1f97]%0Amodule.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0f4ab1a1c01510657]%0Amodule.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-04a005e3c981f98011080289494]%0Aaws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-844562651]%0Amodule.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0c2656be80ccf73b5]%0Amodule.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0ab9ee2a722845733]%0Amodule.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0e182b46e28a84380]%0Amodule.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-094ec60ad1531eeb5]%0Amodule.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-00d6b7549b076f2d9]%0Amodule.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-04ba37f781522f10e]%0Amodule.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-030a489d8399a107a1080289494]%0Amodule.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0459a6c028894452a1080289494]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_lb.alb will be created%0A  + resource "aws_lb" "alb" {%0A      + arn                                                          = (known after apply)%0A      + arn_suffix                                                   = (known after apply)%0A      + client_keep_alive                                            = 3600%0A      + desync_mitigation_mode                                       = "defensive"%0A      + dns_name                                                     = (known after apply)%0A      + drop_invalid_header_fields                                   = false%0A      + enable_deletion_protection                                   = false%0A      + enable_http2                                                 = true%0A      + enable_tls_version_and_cipher_suite_headers                  = false%0A      + enable_waf_fail_open                                         = false%0A      + enable_xff_client_port                                       = false%0A      + enable_zonal_shift                                           = false%0A      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)%0A      + id                                                           = (known after apply)%0A      + idle_timeout                                                 = 60%0A      + internal                                                     = (known after apply)%0A      + ip_address_type                                              = (known after apply)%0A      + load_balancer_type                                           = "application"%0A      + name                                                         = "go-simple-server-alb"%0A      + name_prefix                                                  = (known after apply)%0A      + preserve_host_header                                         = false%0A      + security_groups                                              = [%0A          + "sg-012c8de90de2f8baf",%0A        ]%0A      + subnets                                                      = [%0A          + "subnet-06c8865a563239fd1",%0A          + "subnet-0ecb407aff77341b6",%0A        ]%0A      + tags_all                                                     = (known after apply)%0A      + vpc_id                                                       = (known after apply)%0A      + xff_header_processing_mode                                   = "append"%0A      + zone_id                                                      = (known after apply)%0A%0A      + subnet_mapping {%0A          + allocation_id        = (known after apply)%0A          + ipv6_address         = (known after apply)%0A          + outpost_id           = (known after apply)%0A          + private_ipv4_address = (known after apply)%0A          + subnet_id            = (known after apply)%0A        }%0A    }%0A%0A  # aws_lb_listener.alb_listener will be created%0A  + resource "aws_lb_listener" "alb_listener" {%0A      + arn                                                                   = (known after apply)%0A      + id                                                                    = (known after apply)%0A      + load_balancer_arn                                                     = (known after apply)%0A      + port                                                                  = 80%0A      + protocol                                                              = "HTTP"%0A      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)%0A      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)%0A      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)%0A      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)%0A      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)%0A      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)%0A      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)%0A      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)%0A      + routing_http_response_access_control_max_age_header_value             = (known after apply)%0A      + routing_http_response_content_security_policy_header_value            = (known after apply)%0A      + routing_http_response_server_enabled                                  = (known after apply)%0A      + routing_http_response_strict_transport_security_header_value          = (known after apply)%0A      + routing_http_response_x_content_type_options_header_value             = (known after apply)%0A      + routing_http_response_x_frame_options_header_value                    = (known after apply)%0A      + ssl_policy                                                            = (known after apply)%0A      + tags_all                                                              = (known after apply)%0A      + tcp_idle_timeout_seconds                                              = (known after apply)%0A%0A      + default_action {%0A          + order = (known after apply)%0A          + type  = "fixed-response"%0A%0A          + fixed_response {%0A              + content_type = "text/plain"%0A              + message_body = "Fixed response content"%0A              + status_code  = "200"%0A            }%0A        }%0A%0A      + mutual_authentication {%0A          + advertise_trust_store_ca_names   = (known after apply)%0A          + ignore_client_certificate_expiry = (known after apply)%0A          + mode                             = (known after apply)%0A          + trust_store_arn                  = (known after apply)%0A        }%0A    }%0A%0A  # aws_lb_listener_rule.alb_listener_rule will be created%0A  + resource "aws_lb_listener_rule" "alb_listener_rule" {%0A      + arn          = (known after apply)%0A      + id           = (known after apply)%0A      + listener_arn = (known after apply)%0A      + priority     = (known after apply)%0A      + tags_all     = (known after apply)%0A%0A      + action {%0A          + order            = (known after apply)%0A          + target_group_arn = (known after apply)%0A          + type             = "forward"%0A        }%0A%0A      + condition {%0A%0A          + path_pattern {%0A              + values = [%0A                  + "*",%0A                ]%0A            }%0A        }%0A    }%0A%0A  # aws_lb_target_group.target_group will be created%0A  + resource "aws_lb_target_group" "target_group" {%0A      + arn                                = (known after apply)%0A      + arn_suffix                         = (known after apply)%0A      + connection_termination             = (known after apply)%0A      + deregistration_delay               = "300"%0A      + id                                 = (known after apply)%0A      + ip_address_type                    = (known after apply)%0A      + lambda_multi_value_headers_enabled = false%0A      + load_balancer_arns                 = (known after apply)%0A      + load_balancing_algorithm_type      = (known after apply)%0A      + load_balancing_anomaly_mitigation  = (known after apply)%0A      + load_balancing_cross_zone_enabled  = (known after apply)%0A      + name                               = "go-simple-server-target-group"%0A      + name_prefix                        = (known after apply)%0A      + port                               = 8080%0A      + preserve_client_ip                 = (known after apply)%0A      + protocol                           = "HTTP"%0A      + protocol_version                   = (known after apply)%0A      + proxy_protocol_v2                  = false%0A      + slow_start                         = 0%0A      + tags_all                           = (known after apply)%0A      + target_type                        = "ip"%0A      + vpc_id                             = "vpc-01d2f3607d1897c0b"%0A%0A      + health_check {%0A          + enabled             = true%0A          + healthy_threshold   = 3%0A          + interval            = 30%0A          + matcher             = (known after apply)%0A          + path                = "/health_checks"%0A          + port                = "traffic-port"%0A          + protocol            = "HTTP"%0A          + timeout             = 5%0A          + unhealthy_threshold = 3%0A        }%0A%0A      + stickiness {%0A          + cookie_duration = (known after apply)%0A          + cookie_name     = (known after apply)%0A          + enabled         = (known after apply)%0A          + type            = (known after apply)%0A        }%0A%0A      + target_failover {%0A          + on_deregistration = (known after apply)%0A          + on_unhealthy      = (known after apply)%0A        }%0A%0A      + target_group_health {%0A          + dns_failover {%0A              + minimum_healthy_targets_count      = (known after apply)%0A              + minimum_healthy_targets_percentage = (known after apply)%0A            }%0A%0A          + unhealthy_state_routing {%0A              + minimum_healthy_targets_count      = (known after apply)%0A              + minimum_healthy_targets_percentage = (known after apply)%0A            }%0A        }%0A%0A      + target_health_state {%0A          + enable_unhealthy_connection_termination = (known after apply)%0A          + unhealthy_draining_interval             = (known after apply)%0A        }%0A    }%0A%0APlan: 4 to add, 0 to change, 0 to destroy.%0Aaws_lb_target_group.target_group: Creating...%0Aaws_lb.alb: Creating...%0Aaws_lb_target_group.target_group: Creation complete after 2s [id=arn:aws:elasticloadbalancing:ap-northeast-1:683134287515:targetgroup/go-simple-server-target-group/061c4d8d8e9b52ed]%0Aaws_lb.alb: Still creating... [10s elapsed]%0Aaws_lb.alb: Still creating... [20s elapsed]%0Aaws_lb.alb: Still creating... [30s elapsed]%0Aaws_lb.alb: Still creating... [40s elapsed]%0Aaws_lb.alb: Still creating... [50s elapsed]%0Aaws_lb.alb: Still creating... [1m0s elapsed]%0Aaws_lb.alb: Still creating... [1m10s elapsed]%0Aaws_lb.alb: Still creating... [1m20s elapsed]%0Aaws_lb.alb: Still creating... [1m30s elapsed]%0Aaws_lb.alb: Still creating... [1m40s elapsed]%0Aaws_lb.alb: Still creating... [1m50s elapsed]%0Aaws_lb.alb: Still creating... [2m0s elapsed]%0Aaws_lb.alb: Still creating... [2m10s elapsed]%0Aaws_lb.alb: Still creating... [2m20s elapsed]%0Aaws_lb.alb: Still creating... [2m30s elapsed]%0Aaws_lb.alb: Still creating... [2m40s elapsed]%0Aaws_lb.alb: Still creating... [2m50s elapsed]%0Aaws_lb.alb: Still creating... [3m0s elapsed]%0Aaws_lb.alb: Creation complete after 3m5s [id=arn:aws:elasticloadbalancing:ap-northeast-1:683134287515:loadbalancer/app/go-simple-server-alb/ae567f9e14a6567d]%0Aaws_lb_listener.alb_listener: Creating...%0Aaws_lb_listener.alb_listener: Creation complete after 1s [id=arn:aws:elasticloadbalancing:ap-northeast-1:683134287515:listener/app/go-simple-server-alb/ae567f9e14a6567d/e9917478e49912ee]%0Aaws_lb_listener_rule.alb_listener_rule: Creating...%0Aaws_lb_listener_rule.alb_listener_rule: Creation complete after 0s [id=arn:aws:elasticloadbalancing:ap-northeast-1:683134287515:listener-rule/app/go-simple-server-alb/ae567f9e14a6567d/e9917478e49912ee/1c3d616d3793774e]%0AReleasing state lock. This may take a few moments...%0A%0AApply complete! Resources: 4 added, 0 changed, 0 destroyed.%0A
::debug::stderr: 
::debug::exitcode: 0

::set-output name=stdout::module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-01d2f3607d1897c0b]%0Amodule.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-07a0d641cf5155989]%0Amodule.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d9f484e26ad70778]%0Amodule.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-005b54589c2b6da5f]%0Amodule.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0e65c15767a8f3803]%0Aaws_security_group.alb: Refreshing state... [id=sg-012c8de90de2f8baf]%0Amodule.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-09569d2eb812a2f7d]%0Aaws_security_group.ecs: Refreshing state... [id=sg-041f8ed7691d70ce5]%0Amodule.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-08a9a127f143f34c0]%0Amodule.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-04a005e3c981f9801]%0Amodule.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0459a6c028894452a]%0Amodule.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-030a489d8399a107a]%0Amodule.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-06c8865a563239fd1]%0Amodule.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0ecb407aff77341b6]%0Amodule.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-018ff3bbcd43e1f97]%0Amodule.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0f4ab1a1c01510657]%0Amodule.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-04a005e3c981f98011080289494]%0Aaws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-844562651]%0Amodule.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0c2656be80ccf73b5]%0Amodule.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0ab9ee2a722845733]%0Amodule.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0e182b46e28a84380]%0Amodule.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-094ec60ad1531eeb5]%0Amodule.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-00d6b7549b076f2d9]%0Amodule.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-04ba37f781522f10e]%0Amodule.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-030a489d8399a107a1080289494]%0Amodule.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0459a6c028894452a1080289494]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_lb.alb will be created%0A  + resource "aws_lb" "alb" {%0A      + arn                                                          = (known after apply)%0A      + arn_suffix                                                   = (known after apply)%0A      + client_keep_alive                                            = 3600%0A      + desync_mitigation_mode                                       = "defensive"%0A      + dns_name                                                     = (known after apply)%0A      + drop_invalid_header_fields                                   = false%0A      + enable_deletion_protection                                   = false%0A      + enable_http2                                                 = true%0A      + enable_tls_version_and_cipher_suite_headers                  = false%0A      + enable_waf_fail_open                                         = false%0A      + enable_xff_client_port                                       = false%0A      + enable_zonal_shift                                           = false%0A      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)%0A      + id                                                           = (known after apply)%0A      + idle_timeout                                                 = 60%0A      + internal                                                     = (known after apply)%0A      + ip_address_type                                              = (known after apply)%0A      + load_balancer_type                                           = "application"%0A      + name                                                         = "go-simple-server-alb"%0A      + name_prefix                                                  = (known after apply)%0A      + preserve_host_header                                         = false%0A      + security_groups                                              = [%0A          + "sg-012c8de90de2f8baf",%0A        ]%0A      + subnets                                                      = [%0A          + "subnet-06c8865a563239fd1",%0A          + "subnet-0ecb407aff77341b6",%0A        ]%0A      + tags_all                                                     = (known after apply)%0A      + vpc_id                                                       = (known after apply)%0A      + xff_header_processing_mode                                   = "append"%0A      + zone_id                                                      = (known after apply)%0A%0A      + subnet_mapping {%0A          + allocation_id        = (known after apply)%0A          + ipv6_address         = (known after apply)%0A          + outpost_id           = (known after apply)%0A          + private_ipv4_address = (known after apply)%0A          + subnet_id            = (known after apply)%0A        }%0A    }%0A%0A  # aws_lb_listener.alb_listener will be created%0A  + resource "aws_lb_listener" "alb_listener" {%0A      + arn                                                                   = (known after apply)%0A      + id                                                                    = (known after apply)%0A      + load_balancer_arn                                                     = (known after apply)%0A      + port                                                                  = 80%0A      + protocol                                                              = "HTTP"%0A      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)%0A      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)%0A      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)%0A      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)%0A      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)%0A      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)%0A      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)%0A      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)%0A      + routing_http_response_access_control_max_age_header_value             = (known after apply)%0A      + routing_http_response_content_security_policy_header_value            = (known after apply)%0A      + routing_http_response_server_enabled                                  = (known after apply)%0A      + routing_http_response_strict_transport_security_header_value          = (known after apply)%0A      + routing_http_response_x_content_type_options_header_value             = (known after apply)%0A      + routing_http_response_x_frame_options_header_value                    = (known after apply)%0A      + ssl_policy                                                            = (known after apply)%0A      + tags_all                                                              = (known after apply)%0A      + tcp_idle_timeout_seconds                                              = (known after apply)%0A%0A      + default_action {%0A          + order = (known after apply)%0A          + type  = "fixed-response"%0A%0A          + fixed_response {%0A              + content_type = "text/plain"%0A              + message_body = "Fixed response content"%0A              + status_code  = "200"%0A            }%0A        }%0A%0A      + mutual_authentication {%0A          + advertise_trust_store_ca_names   = (known after apply)%0A          + ignore_client_certificate_expiry = (known after apply)%0A          + mode                             = (known after apply)%0A          + trust_store_arn                  = (known after apply)%0A        }%0A    }%0A%0A  # aws_lb_listener_rule.alb_listener_rule will be created%0A  + resource "aws_lb_listener_rule" "alb_listener_rule" {%0A      + arn          = (known after apply)%0A      + id           = (known after apply)%0A      + listener_arn = (known after apply)%0A      + priority     = (known after apply)%0A      + tags_all     = (known after apply)%0A%0A      + action {%0A          + order            = (known after apply)%0A          + target_group_arn = (known after apply)%0A          + type             = "forward"%0A        }%0A%0A      + condition {%0A%0A          + path_pattern {%0A              + values = [%0A                  + "*",%0A                ]%0A            }%0A        }%0A    }%0A%0A  # aws_lb_target_group.target_group will be created%0A  + resource "aws_lb_target_group" "target_group" {%0A      + arn                                = (known after apply)%0A      + arn_suffix                         = (known after apply)%0A      + connection_termination             = (known after apply)%0A      + deregistration_delay               = "300"%0A      + id                                 = (known after apply)%0A      + ip_address_type                    = (known after apply)%0A      + lambda_multi_value_headers_enabled = false%0A      + load_balancer_arns                 = (known after apply)%0A      + load_balancing_algorithm_type      = (known after apply)%0A      + load_balancing_anomaly_mitigation  = (known after apply)%0A      + load_balancing_cross_zone_enabled  = (known after apply)%0A      + name                               = "go-simple-server-target-group"%0A      + name_prefix                        = (known after apply)%0A      + port                               = 8080%0A      + preserve_client_ip                 = (known after apply)%0A      + protocol                           = "HTTP"%0A      + protocol_version                   = (known after apply)%0A      + proxy_protocol_v2                  = false%0A      + slow_start                         = 0%0A      + tags_all                           = (known after apply)%0A      + target_type                        = "ip"%0A      + vpc_id                             = "vpc-01d2f3607d1897c0b"%0A%0A      + health_check {%0A          + enabled             = true%0A          + healthy_threshold   = 3%0A          + interval            = 30%0A          + matcher             = (known after apply)%0A          + path                = "/health_checks"%0A          + port                = "traffic-port"%0A          + protocol            = "HTTP"%0A          + timeout             = 5%0A          + unhealthy_threshold = 3%0A        }%0A%0A      + stickiness {%0A          + cookie_duration = (known after apply)%0A          + cookie_name     = (known after apply)%0A          + enabled         = (known after apply)%0A          + type            = (known after apply)%0A        }%0A%0A      + target_failover {%0A          + on_deregistration = (known after apply)%0A          + on_unhealthy      = (known after apply)%0A        }%0A%0A      + target_group_health {%0A          + dns_failover {%0A              + minimum_healthy_targets_count      = (known after apply)%0A              + minimum_healthy_targets_percentage = (known after apply)%0A            }%0A%0A          + unhealthy_state_routing {%0A              + minimum_healthy_targets_count      = (known after apply)%0A              + minimum_healthy_targets_percentage = (known after apply)%0A            }%0A        }%0A%0A      + target_health_state {%0A          + enable_unhealthy_connection_termination = (known after apply)%0A          + unhealthy_draining_interval             = (known after apply)%0A        }%0A    }%0A%0APlan: 4 to add, 0 to change, 0 to destroy.%0Aaws_lb_target_group.target_group: Creating...%0Aaws_lb.alb: Creating...%0Aaws_lb_target_group.target_group: Creation complete after 2s [id=arn:aws:elasticloadbalancing:ap-northeast-1:683134287515:targetgroup/go-simple-server-target-group/061c4d8d8e9b52ed]%0Aaws_lb.alb: Still creating... [10s elapsed]%0Aaws_lb.alb: Still creating... [20s elapsed]%0Aaws_lb.alb: Still creating... [30s elapsed]%0Aaws_lb.alb: Still creating... [40s elapsed]%0Aaws_lb.alb: Still creating... [50s elapsed]%0Aaws_lb.alb: Still creating... [1m0s elapsed]%0Aaws_lb.alb: Still creating... [1m10s elapsed]%0Aaws_lb.alb: Still creating... [1m20s elapsed]%0Aaws_lb.alb: Still creating... [1m30s elapsed]%0Aaws_lb.alb: Still creating... [1m40s elapsed]%0Aaws_lb.alb: Still creating... [1m50s elapsed]%0Aaws_lb.alb: Still creating... [2m0s elapsed]%0Aaws_lb.alb: Still creating... [2m10s elapsed]%0Aaws_lb.alb: Still creating... [2m20s elapsed]%0Aaws_lb.alb: Still creating... [2m30s elapsed]%0Aaws_lb.alb: Still creating... [2m40s elapsed]%0Aaws_lb.alb: Still creating... [2m50s elapsed]%0Aaws_lb.alb: Still creating... [3m0s elapsed]%0Aaws_lb.alb: Creation complete after 3m5s [id=arn:aws:elasticloadbalancing:ap-northeast-1:683134287515:loadbalancer/app/go-simple-server-alb/ae567f9e14a6567d]%0Aaws_lb_listener.alb_listener: Creating...%0Aaws_lb_listener.alb_listener: Creation complete after 1s [id=arn:aws:elasticloadbalancing:ap-northeast-1:683134287515:listener/app/go-simple-server-alb/ae567f9e14a6567d/e9917478e49912ee]%0Aaws_lb_listener_rule.alb_listener_rule: Creating...%0Aaws_lb_listener_rule.alb_listener_rule: Creation complete after 0s [id=arn:aws:elasticloadbalancing:ap-northeast-1:683134287515:listener-rule/app/go-simple-server-alb/ae567f9e14a6567d/e9917478e49912ee/1c3d616d3793774e]%0AReleasing state lock. This may take a few moments...%0A%0AApply complete! Resources: 4 added, 0 changed, 0 destroyed.%0A

::set-output name=stderr::

::set-output name=exitcode::0

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":4,"Program":"tfcmt","SHA1":"28a85bbfd81ed9d0609c6174a88b41e37d593e9f","Vars":{},"WorkflowName":"Terraform"} -->